title: Applications That Are Using ROPC Authentication Flow
id: 4c6ebfd1-23cf-4f25-9b5c-0325c21c3bde
status: test
description: |
    Resource owner password credentials (ROPC) should be avoided if at all possible as this requires the user to expose their current password credentials to the application directly.
    The application then uses those credentials to authenticate the user against the identity provider.
references:
  - https://learn.microsoft.com/en-us/entra/architecture/security-operations-applications#application-authentication-flows
author: Mark Morowczynski '@markmorow', Bailey Bercik '@baileybercik'
date: 2022-06-01
tags:
  - attack.t1078.004
logsource:
  product: azure
  service: signinlogs
detection:
  selection:
    properties.message: ROPC
  condition: selection
falsepositives:
  - Applications that are being used as part of automated testing or a legacy application that cannot use any other modern authentication flow
level: medium