title: Potential Persistence Via DLLPathOverride
id: 497192bd-4bd2-4afa-93cc-5d1006cbe8b9
status: test
description: Detects when an attacker adds a new "DLLPathOverride" value to the "Natural Language" key in order to achieve persistence which will get invoked by "SearchIndexer.exe" process
references:
  - https://persistence-info.github.io/Data/naturallanguage6.html
  - https://www.hexacorn.com/blog/2018/12/30/beyond-good-ol-run-key-part-98/
author: Nasreddine Bencherchali (Nextron Systems)
date: 2022-07-21
modified: 2023-08-17
tags:
  - attack.persistence
logsource:
  category: registry_set
  product: windows
detection:
  selection_root:
    TargetObject|contains: '\SYSTEM\CurrentControlSet\Control\ContentIndex\Language\'
  selection_values:
    TargetObject|contains:
      - '\StemmerDLLPathOverride'
      - '\WBDLLPathOverride'
      - '\StemmerClass'
      - '\WBreakerClass'
  condition: all of selection_*
falsepositives:
  - Unknown
level: high