title: USB Device Plug/Unplug Events on Windows Host
id: 08fd7fad-5393-4452-b3b9-716ef9ceea49
status: test
description: Detects USB device plug/unplug events on a Windows host, indicating physical access attacks or data exfiltration via removable media.
references:
    - https://df-stream.com/2014/01/the-windows-7-event-log-and-usb-device/
    - https://www.techrepublic.com/article/how-to-track-down-usb-flash-drive-usage-in-windows-10s-event-viewer/
author: Your Name
date: 2023-02-20
modified: 2023-02-20
tags:
    - attack.initial-access
    - attack.t1200
logsource:
    product: windows
    service: driver-framework
    definition: 'Requires enabling and collection of the Microsoft-Windows-DriverFrameworks-UserMode/Operational eventlog'
detection:
    selection:
        EventID:
            - 2003  # Loading drivers
            - 2100  # Pnp or power management
            - 2102  # Pnp or power management
    condition: selection
falsepositives:
    - Legitimate administrative activity
level: low