title: Detecting USB Data Exfiltration
id: f31f7870-0717-41f3-af05-babd1d417a9f
status: test
description: Detects potential data exfiltration via USB devices.
references:
    - https://learn.microsoft.com/en-us/previous-versions/windows/it-pro/windows-10/security/threat-protection/auditing/event-6416
    - https://community.openvpn.net/openvpn/wiki/ManagingWindowsTAPDrivers
author: Your Name
date: 2023-02-20
modified: 2023-02-20
tags:
    - attack.t1091
    - attack.t1200
logsource:
    product: windows
    service: security
detection:
    selection_eid:
        EventID: 20001
    selection_field:
        - ClassName: 'DiskDrive'
        - DeviceDescription: 'USB Mass Storage Device'
    condition: all of selection_*
falsepositives:
    - Likely
level: low