title: PsExec Service File Creation

id: 3ddd91ad-361f-487d-b430-bf6019d6ae02

status: test

description: Detects default PsExec service filename which indicates PsExec service installation and execution

references:
  - https://www.jpcert.or.jp/english/pub/sr/ir_research.html
  - https://jpcertcc.github.io/ToolAnalysisResultSheet

author: Thomas Patzke

date: 2017-06-12

modified: 2022-10-26

tags:
  - attack.t1569.002

logsource:
  category: registry_event
  product: windows

detection:
  selection:
    TargetFilename|contains: '\\PSEXESVC.exe'
  condition: selection

falsepositives:
  - Unknown

level: low