title: Detecting Lateral Movement through Tracking Event Logs
id: cdd152c8-02ee-484a-b714-7f164280461c
description: Detects lateral movement by tracking event logs.
author: Your Name
date: 2023/02/20
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        command_line|contains: powershell.exe
        image_loaded|endswith: .exe
    condition: selection
references:
    - https://www.jpcert.or.jp/english/pub/sr/ir_research.html
    - https://jpcertcc.github.io/ToolAnalysisResultSheet