title: Nginx Core Dump Detection
id: 5c3dec0d-ca37-497b-91c4-9a47bfaa381e
status: test
description: Detects potential core dump in Nginx worker process
references:
  - https://docs.nginx.com/nginx/admin-guide/monitoring/debugging/#enabling-core-dumps
  - https://www.x41-dsec.de/lab/advisories/x41-2021-002-nginx-resolver-copy/
logsource:
  category: process_access
  product: nginx
detection:
  selection:
    EventID: 'core dump'
    Provider_Name: 'Nginx'
    Data|contains: 'core dump'
  condition: selection
falsepositives:
  - Legitimate core dump during debugging or testing
level: high