title: Suspicious Django Web Application Framework Exceptions
id: 3f8fe97d-07c2-4b33-9834-f678eb5a3b6c
status: test
description: Detects suspicious Django web application framework exceptions that could indicate exploitation attempts.
references:
  - https://docs.djangoproject.com/en/4.1/topics/http/middleware/
logsource:
  category: process_creation
  product: django
detection:
  selection:
    exception_type|contains: CSRF
    exception_message|contains: "CSRF token missing or incorrect"
  condition: 1 of selection
falsepositives:
  - Authorized administrative activity
level: high