title: Create Remote Thread In Shell Application
id: f7cad2a6-a623-453c-a41e-9ac376580c29
description: Detects suspicious process injection in command shell applications, specifically targeting cmd.exe and powershell.exe.
status: experimental
author: '@ATACK'
date: 2023/09/01
logsource:
    category: process_creation
    product: windows
detection:
    selection:
        EventID: 8
        Image|endswith: ['cmd.exe', 'powershell.exe']
    condition: selection
falsepositives:
    - Unknown
level: high
tags:
    - attack.t1055
    - attack.execution