title: Bitbucket Audit Log Configuration Updated
id: 9213e813-6bd8-462d-8d69-732379aa2e04
status: test
description: Detects changes to the bitbucket audit log configuration.
references:
  - https://confluence.atlassian.com/bitbucketserver/view-and-configure-the-audit-log-776640417.html
author: Muhammad Faisal (@faisalusuf)
date: 2024-02-25
tags:
  - attack.t1685
logsource:
  product: bitbucket
  service: audit
  definition: 'Requirements: "Basic" log level is required to receive these audit events.'
detection:
  selection:
    auditType.category: 'Auditing'
    auditType.action: 'Audit log configuration updated'
  condition: selection
falsepositives:
  - Legitimate user activity.
level: medium