title: Bitbucket Data Exfiltration via Audit Log
id: 52cd2345-fc5c-4f61-ba72-281f086a060e
status: test
description: Detects unauthorized data exfiltration from Bitbucket audit log
references:
  - https://confluence.atlassian.com/bitbucketserver/audit-log-events-776640423.html
  - https://confluence.atlassian.com/bitbucketserver/secret-scanning-1157471613.html
author: Your Name
date: 2026-05-20
tags:
  - attack.t1048
logsource:
  product: bitbucket
  service: audit
definition: 'Requirements: "Advance" log level is required to receive these audit events.'
detection:
  selection:
    auditType.category: Data Exfiltration
    auditType.action: Exact match for the specific action (e.g., "Data exfiltrated")
  condition: selection
falsepositives:
  - Legitimate user activity.
level: high