title: Bitbucket Full Data Export Attempt
id: c7e59991-f3b3-4b53-9104-891d10709306
status: test
description: Detects when a user attempts to export all data from Bitbucket.
references:
  - https://confluence.atlassian.com/bitbucketserver/audit-log-events-776640423.html
  - https://confluence.atlassian.com/bitbucketserver/secret-scanning-1157471613.html
author: Your Name
date: 2024-02-25
tags:
  - attack.collection
  - attack.reconnaissance
logsource:
  product: bitbucket
  service: audit
definition: 'Requirements: "Advance" log level is required to receive these audit events.'
detection:
  selection:
    auditType.category: 'Data and settings'
    auditType.action: 'Export all data'
  condition: selection
falsepositives:
  - Legitimate user activity.
level: high