title: Kubernetes Secrets Enumeration

id: dad63251-939a-4aad-bdf3-b1826a03b349

related:
  - id: 7ee0b4aa-d8d4-4088-b661-20efdf41a04c
    type: derived

status: test

description: Detects enumeration of Kubernetes secrets.

references:
  - https://microsoft.github.io/Threat-Matrix-for-Kubernetes/techniques/List%20K8S%20secrets/
  - https://kubernetes.io/docs/reference/config-api/apiserver-audit.v1/

author: Leo Tsaousis (@laripping)

date: 2024-03-26

tags:
  - attack.t1552.007
  - attack.credential-access

logsource:
  category: application
  product: kubernetes
  service: audit

detection:
  selection:
    objectRef.resource: secrets
    verb: list
  condition: selection

falsepositives:
  - The Kubernetes dashboard occasionally accesses the kubernetes-dashboard-key-holder secret

level: low