title: Github Delete Organization Role
id: 8c34374e-4614-4b80-a187-0092282d7028
status: test
description: Detects when an organization role is deleted in GitHub.
references:
    - https://docs.github.com/en/organizations/keeping-your-organization-secure/managing-security-settings/reviewing-the-audit-log-for-your-organization#audit-log-actions
    - https://docs.github.com/en/authentication/keeping-your-account-and-data-secure/security-log-events#codespaces
author: Your Name
date: 2023-01-20
tags:
    - attack.t1089
logsource:
    product: github
    service: audit
detection:
    selection:
        action:
            - 'org.delete_role'
    condition: selection
falsepositives:
    - Unknown
level: medium