title: Detecting Abuse of Telegram's Bot API
id: be0aa201-7655-4e9c-95fe-ee0427753f9c
logsource:
  category: network_connection
detection:
  selection: destination | contains "api.telegram.org"
  condition: selection
references:
- https://researchcenter.paloaltonetworks.com/2018/03/unit42-telerat-another-android-trojan-leveraging-telegrams-bot-api-to-target-iranian-users/
- https://blog.malwarebytes.com/threat-analysis/2016/11/telecrypt-the-ransomware-abusing-telegram-api-defeated/
- https://www.welivesecurity.com/2016/12/13/rise-telebots-analyzing-disruptive-killdisk-attacks/
