title: Unsigned Module Loaded by ClickOnce Application
id: bd88c62b-2d35-49ed-b11e-378e9c962987
status: test
description: Detects unsigned module load by ClickOnce application
references:
    - https://posts.specterops.io/less-smartscreen-more-caffeine-ab-using-clickonce-for-trusted-code-execution-1446ea8051c5
author: Your Name
date: 2023-09-01
tags:
    - attack.t1059
logsource:
    category: image_load
    product: windows
detection:
    selection:
        ImageLoaded|contains: \AppData\Local\Temp\
        EventID: 3001 # Code Integrity determined an unsigned kernel module %2 is loaded into the system. Check with the publisher to see if a signed version of the kernel module is available.
    condition: or
falsepositives:
    - Unlikely
level: high