title: SQL Injection Detection
id: f804c14f-347d-4ac7-8838-f44b0d676c3d
status: test
description: Detects SQL injection attempts via GET requests in web server logs
references:
  - https://www.acunetix.com/blog/articles/exploiting-sql-injection-example/
  - https://www.acunetix.com/blog/articles/using-logs-to-investigate-a-web-application-attack/
author: Your Name
date: 2023/03/01
modified: 2023/03/01
tags:
  - attack.initial-access
  - cve.2026.3487
logsource:
  category: webserver
detection:
  selection_method:
    cs-method: 'GET'
  selection_query:
    cs-uri-query|contains|all:
      - '+--'
      - '+AS+'
      - '+OR+'
      - 'FROM'
      - 'ORDER+BY'
      - 'SELECT'
      - 'sleep%28'
      - 'substring%28'
      - 'UNION'
      - 'WHERE'
  condition: all of selection_*
falsepositives:
  - Vulnerability scanners
level: high