title: DNS Query To Katz Stealer Domains
id: c61e9e30-f45f-4fcc-be03-e76213966e26
status: experimental
description: |
    Detects DNS queries to domains associated with Katz Stealer malware.
    Katz Stealer is a malware variant that is known to be used for stealing sensitive information from compromised systems.
    In Enterprise environments, DNS queries to these domains may indicate potential malicious activity or compromise.
references:
  - Internal Research
author: Swachchhanda Shrawan Poudel (Nextron Systems)
date: 2025-05-22
tags:
  - attack.command-and-control
  - attack.t1071.004
  - detection.emerging-threats
logsource:
  product: windows
  category: dns_query
detection:
  selection:
    QueryName|contains:
      - 'katz-panel.com'
      - 'katz-stealer.com'
      - 'katzstealer.com'
      - 'twist2katz.com'
  condition: selection
falsepositives:
  - Unlikely
level: high