title: Mimikatz Use Detection
id: f8bfd76a-a27b-4e3e-a3a7-19dceb9cda04
status: test
description: Detects the use of mimikatz in memory
references:
  - https://tools.thehacker.recipes/mimikatz/modules
author: "Seu Nome"
date: 2023-07-20
modified: 2023-07-20
tags:
  - attack.s0002
  - attack.lateral-movement
  - attack.credential-access
logsource:
  product: windows
detection:
  selection:
    ImageLoaded: '*\mimikatz.dll'
  condition: selection
falsepositives:
  - Unlikely
level: high